tests/hash-backend-performance/scripts/artillery.yml
config:
  target: "http://localhost:5001/graphql"
  phases:
    - duration: 5 seconds
      arrivalRate: 15
  plugins:
    expect: {}

scenarios:
  - name: "Read entity type by ID"
    flow:
      - loop:
          - post:
              url: "/"
              json:
                query: |
                  query {
                    getEntityType(
                      entityTypeId: "https://blockprotocol.org/@blockprotocol/types/entity-type/thing/v/1",
                      constrainsValuesOn: { outgoing: 0 },
                      constrainsPropertiesOn: { outgoing: 0 },
                      constrainsLinksOn: { outgoing: 0 },
                      constrainsLinkDestinationsOn: { outgoing: 0 },
                      inheritsFrom: { outgoing: 0 },
                      includeArchived: false
                    ) {
                      roots
                    }
                  }
              expect:
                - statusCode: 200
        count: 200